app/controllers/brite_controller.rb

INSERT INTO "experiments" ("created_at", "topology", "updated_at", "user_id") VALUES (?, ?, ?, ?)
---
	def create
		if params[:tww_button]
			@all_params = params[:tww_form]
		elsif params[:tbw_button]
			@all_params = params[:tbw_form]
		elsif params[:asw_button]
			@all_params = params[:aswaxman_form]
		elsif params[:rtb_button]
			@all_params = params[:rtbarabasi_form]
		elsif params[:rtw_button]
			@all_params = params[:rtwaxman_form]
		end

		@file_conf = file(@all_params)
		@user_id = current_user.id.to_s
		@parent_dir = File.expand_path(Dir.getwd)

		File.open("app/temp/"+@user_id+ ".conf", "w") do |f|
			f.write(@file_conf)
		end

		config_to_brite(@parent_dir+"/app/temp/"+@user_id+ ".conf", @parent_dir+"/app/temp/"+@user_id)

		#system("cd app/views/force/; python force.py " + @parent_dir+"/app/temp/"+@user_id+".brite")

		@topo = File.read("app/temp/"+@user_id+ ".brite")

		Experiment.create(:user_id => @user_id.to_i, :topology => @topo.to_s)