app/controllers/experiments_controller.rb

    def home
    	if signed_in?
      		@experiment = Experiment.select("id, created_at").where(user_id: current_user.id.to_i).paginate(page: params[:page], per_page: 10)
---
SELECT  id, created_at FROM "experiments"  WHERE "experiments"."user_id" = 1 LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "experiments"  WHERE "experiments"."user_id" = 1

    def destroy
	@model = Experiment.select("id").where(id: params[:id].to_i, user_id: current_user.id.to_i)

  	if @model.present? and @model.count == 1
  		@model.first.destroy
---
SELECT "experiments"."id" FROM "experiments"  WHERE "experiments"."id" = 1 AND "experiments"."user_id" = 1
SELECT COUNT("experiments"."id") FROM "experiments"  WHERE "experiments"."id" = 1 AND "experiments"."user_id" = 1
DELETE FROM "experiments" WHERE "experiments"."id" = ?  [["id", 1]]