app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
      @captcha_message = "CAPTCHA Incorrect"
      @user = User.new(user_params)
      if verify_recaptcha(model: @user, message: @captcha_message) || @user.save